Revit 2027 API
SpotLightDistribution.TiltAngle Property
 The tilt angle.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TiltAngle { get; set; }
Public Property TiltAngle As Double
	Get
	Set
public:
property double TiltAngle {
	double get ();
	void set (double value);
}
member TiltAngle : float with get, set
Property Value
Double
 The tilt angle as a numerical value in radians between -PI and PI.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The angle is not valid because it is not between -180.0 and 180.0.
See Also
Reference
SpotLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace